_org/_posts/2021-09-16-python-multiprocessing-pool.org
#+BEGIN_EXPORT html
---
layout: post
title: Using Futures and the ProcessPoolExecutor in python
date: 2021-09-16
published: true
categories: python multiprocessing
---
#+END_EXPORT

* When to use ~ProcessPoolExecutor~
#+OPTIONS: toc:nil num:nil
#+PROPERTY: header-args:bash :exports both :results drawer :wrap src python
  
Using the ~ProcessPoolExecutor~ in ~concurrent.futures~ is a quick way
to divide your workload over multiple processes. This is useful if you
have a couple of tasks that you want to run in parallel to save
time. Compared to the ~ThreadPoolExecutor~, the process pool is a bit
more primitive, basically, the whole process is forked into multiple
copies that each do their own business, with the
~concurrent.futures.ProcessPoolExecutor~ taking care of cleaning up
and basic communication between the tasks.

|          | ~ProcessPoolExecutor~    | ~ThreadPoolExecutor~             |
|----------+--------------------------+----------------------------------|
| strength | Parallel CPU bound tasks | Parellel IO bound tasks          |
| weakness | Memory usage             | Limited to single CPU due to GIL |

You should use the ~ProcessPoolExecutor~ over the ~ThreadPoolExecutor~
if your tasks are CPU bound. The weakness of copying the process is
that you also copy it's memory which may add up, there is a bit more
overhead when compared to splitting into threads, but, the big
advantage is that multiple processes each can use up to 100% of a
single CPU core, while, due to the limitations of the Global
Interpreter Lock, multiple threads will not saturate multiple
CPU's. There's a couple of holes in this simplified model, for
example, python code can sometimes release the GIL, notably ~numpy~
code, in which case threads can also effectively use multiple
GPU's. But for now, let's not worry about those details too much and
learn how to use multiprocessing easily in python.

