_posts/2021-09-16-python-multiprocessing-pool.md
---
layout: post
title: Using Futures and the ProcessPoolExecutor in python
date: 2021-09-16
published: true
categories: python multiprocessing
---

<div id="outline-container-org0804d4f" class="outline-2">
<h2 id="org0804d4f">When to use <code>ProcessPoolExecutor</code></h2>
<div class="outline-text-2" id="text-org0804d4f">
<p>
Using the <code>ProcessPoolExecutor</code> in <code>concurrent.futures</code> is a quick way
to divide your workload over multiple processes. This is useful if you
have a couple of tasks that you want to run in parallel to save
time. Compared to the <code>ThreadPoolExecutor</code>, the process pool is a bit
more primitive, basically, the whole process is forked into multiple
copies that each do their own business, with the
<code>concurrent.futures.ProcessPoolExecutor</code> taking care of cleaning up
and basic communication between the tasks.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left"><code>ProcessPoolExecutor</code></th>
<th scope="col" class="org-left"><code>ThreadPoolExecutor</code></th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">strength</td>
<td class="org-left">Parallel CPU bound tasks</td>
<td class="org-left">Parellel IO bound tasks</td>
</tr>

<tr>
<td class="org-left">weakness</td>
<td class="org-left">Memory usage</td>
<td class="org-left">Limited to single CPU due to GIL</td>
</tr>
</tbody>
</table>

<p>
You should use the <code>ProcessPoolExecutor</code> over the <code>ThreadPoolExecutor</code>
if your tasks are CPU bound. The weakness of copying the process is
that you also copy it's memory which may add up, there is a bit more
overhead when compared to splitting into threads, but, the big
advantage is that multiple processes each can use up to 100% of a
single CPU core, while, due to the limitations of the Global
Interpreter Lock, multiple threads will not saturate multiple
CPU's. There's a couple of holes in this simplified model, for
example, python code can sometimes release the GIL, notably <code>numpy</code>
code, in which case threads can also effectively use multiple
GPU's. But for now, let's not worry about those details too much and
learn how to use multiprocessing easily in python.
</p>
</div>
