_org/_posts/2021-09-16-python-multiprocessing-pool.org
** Basic multiprocessing with ~os.fork~

First, to get started, have a look at this demonstration of
~os.fork~. In practical terms, this duplicates the running
process. Two copies of the same program will run, basically identical,
except for their ~pid~, their process id.

#+begin_src bash
cat ./src/fork.py
#+end_src

#+RESULTS:
#+begin_src python
import os

os.fork()

print(os.getpid())
#+end_src

#+begin_src bash
python3 ./src/fork.py
#+end_src

#+RESULTS:
#+begin_src python
22313
22314
#+end_src

It is definitely possible to write some multiprocessing code directly
on this primitive system.

#+begin_src bash
cat ./src/fork_mp.py
#+end_src

#+RESULTS:
#+begin_src python
import os
import time
import sys

tasks = list(range(10))

part_a = tasks[:5]
part_b = tasks[5:]

res = os.fork()

if res == 0:
    # main process
    for task in part_a:
        print(f"I am process {os.getpid()} working on task {task}")
        time.sleep(.2)
        sys.stdout.flush()
else:
    # child process
    for task in part_b:
        print(f"I am process {os.getpid()} working on task {task}")
        time.sleep(.2)
        sys.stdout.flush()
        
#+end_src

This program divides the tasks between the two processes. I added a
~time.sleep(0.2)~ for every task, so the tasks in total take two
seconds. The script however takes approximately 1 second to run,
saving exactly one second over running the tasks in a single process.

We use the output of ~os.fork~ to determine which of the processes we
are, if the result is 0, we are the main process, and if the result is
different, we know we are in the child process.

#+begin_src bash
python3 ./src/fork_mp.py
#+end_src

#+RESULTS:
#+begin_src python
I am process 22648 working on task 5
I am process 22649 working on task 0
I am process 22649 working on task 1
I am process 22648 working on task 6
I am process 22649 working on task 2
I am process 22648 working on task 7
I am process 22648 working on task 8
I am process 22649 working on task 3
I am process 22649 working on task 4
I am process 22648 working on task 9
#+end_src

These examples show at a lower level than the ~ProcessPoolExecutor~
how multiprocessing works. However, if you want to extend the latter
approach into working code that deals with failures, passes the tasks
to the processes consistently and also collects the results, you can
see it'll get quite a bit more complicated. Enter the
~ProcessPoolExecutor~, which does all those hard things for you! 

#+begin_src bash
cat ./src/ppool_demo.py
#+end_src

#+RESULTS:
#+begin_src python
from concurrent.futures import ProcessPoolExecutor
import time
import os

tasks = range(10)
start = time.time()


def do_work(task):
    print(f"I am process {os.getpid()} working on task {task}")
    time.sleep(.2)


with ProcessPoolExecutor(max_workers=4) as pool:
    for task in tasks:
        pool.submit(do_work, task)

print(f"Main process done after {time.time() - start:.2f}s")
#+end_src

In only three lines you can start 4 workers that divide the work as
evenly as possible.

- ~pool.submit~ sends a task to one of the workers
- The context manager (~with~ block) waits until all the workers are
  done before proceeding

This example takes 0.6 seconds. We have four workers, 10 tasks, so
some workers get 2 tasks and some get 3 tasks, and the workers with 3
tasks take 3 * 0.2 seconds to finish.

#+begin_src bash
python ./src/ppool_demo.py
#+end_src

#+RESULTS:
#+begin_src python
I am process 22770 working on task 2
I am process 22770 working on task 6
I am process 22771 working on task 3
I am process 22771 working on task 7
I am process 22768 working on task 0
I am process 22768 working on task 4
I am process 22768 working on task 8
I am process 22769 working on task 1
I am process 22769 working on task 5
I am process 22769 working on task 9
Main process done after 0.61s
#+end_src

Note that in the output, the processes seem ordered. However, this is
a subtle effect of buffering of the ~stdout~. Each process has its own
buffer and they flush all their output in one go, making it look like
they run in succession. You can surpress this behaviour by manually
triggering the flushes as I showed earlier with ~sys.stdout.flush()~.

Here, it is crucial that ~pool.submit~ is non-blocking, if you call
the function the main process doesn't wait until the worker is
done. This allows us to schedule all the work to the workers quickly.

There are three things I want to explain in this post

- How you can collect return values of the tasks (using
  ~concurrent.futures.Future~)
- What happens if workers run into an exception and how you can deal
  with it

