_posts/2021-09-16-python-multiprocessing-pool.md

<div id="outline-container-orgecc74a1" class="outline-3">
<h3 id="orgecc74a1">Basic multiprocessing with <code>os.fork</code></h3>
<div class="outline-text-3" id="text-orgecc74a1">
<p>
First, to get started, have a look at this demonstration of
<code>os.fork</code>. In practical terms, this duplicates the running
process. Two copies of the same program will run, basically identical,
except for their <code>pid</code>, their process id.
</p>

<div class="org-src-container">
<pre class="src src-bash">cat ./src/fork.py
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #b6a0ff;">import</span> os

os.fork<span style="color: #ffffff;">()</span>

<span style="color: #f78fe7;">print</span><span style="color: #ffffff;">(</span>os.getpid<span style="color: #ff62d4;">()</span><span style="color: #ffffff;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-bash">python3 ./src/fork.py
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #00bcff;">18359</span>
<span style="color: #00bcff;">18360</span>
</pre>
</div>

<p>
It is definitely possible to write some multiprocessing code directly
on this primitive system.
</p>

<div class="org-src-container">
<pre class="src src-bash">cat ./src/fork_mp.py
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #b6a0ff;">import</span> os
<span style="color: #b6a0ff;">import</span> time
<span style="color: #b6a0ff;">import</span> sys

<span style="color: #00d3d0;">tasks</span> = <span style="color: #f78fe7;">list</span><span style="color: #ffffff;">(</span><span style="color: #f78fe7;">range</span><span style="color: #ff62d4;">(</span><span style="color: #00bcff;">10</span><span style="color: #ff62d4;">)</span><span style="color: #ffffff;">)</span>

<span style="color: #00d3d0;">part_a</span> = tasks<span style="color: #ffffff;">[</span>:<span style="color: #00bcff;">5</span><span style="color: #ffffff;">]</span>
<span style="color: #00d3d0;">part_b</span> = tasks<span style="color: #ffffff;">[</span><span style="color: #00bcff;">5</span>:<span style="color: #ffffff;">]</span>

<span style="color: #00d3d0;">res</span> = os.fork<span style="color: #ffffff;">()</span>

<span style="color: #b6a0ff;">if</span> res == <span style="color: #00bcff;">0</span>:
    <span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">main process</span>
    <span style="color: #b6a0ff;">for</span> task <span style="color: #b6a0ff;">in</span> part_a:
        <span style="color: #f78fe7;">print</span><span style="color: #ffffff;">(</span>f<span style="color: #79a8ff;">"I am process </span>{os.getpid()}<span style="color: #79a8ff;"> working on task </span>{task}<span style="color: #79a8ff;">"</span><span style="color: #ffffff;">)</span>
        time.sleep<span style="color: #ffffff;">(</span>.<span style="color: #00bcff;">2</span><span style="color: #ffffff;">)</span>
        sys.stdout.flush<span style="color: #ffffff;">()</span>
<span style="color: #b6a0ff;">else</span>:
    <span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">child process</span>
    <span style="color: #b6a0ff;">for</span> task <span style="color: #b6a0ff;">in</span> part_b:
        <span style="color: #f78fe7;">print</span><span style="color: #ffffff;">(</span>f<span style="color: #79a8ff;">"I am process </span>{os.getpid()}<span style="color: #79a8ff;"> working on task </span>{task}<span style="color: #79a8ff;">"</span><span style="color: #ffffff;">)</span>
        time.sleep<span style="color: #ffffff;">(</span>.<span style="color: #00bcff;">2</span><span style="color: #ffffff;">)</span>
        sys.stdout.flush<span style="color: #ffffff;">()</span>

</pre>
</div>

<p>
This program divides the tasks between the two processes. I added a
<code>time.sleep(0.2)</code> for every task, so the tasks in total take two
seconds. The script however takes approximately 1 second to run,
saving exactly one second over running the tasks in a single process.
</p>

<p>
We use the output of <code>os.fork</code> to determine which of the processes we
are, if the result is 0, we are the main process, and if the result is
different, we know we are in the child process.
</p>

<div class="org-src-container">
<pre class="src src-bash">python3 ./src/fork_mp.py
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python">I am process <span style="color: #00bcff;">18377</span> working on task <span style="color: #00bcff;">0</span>
I am process <span style="color: #00bcff;">18376</span> working on task <span style="color: #00bcff;">5</span>
I am process <span style="color: #00bcff;">18377</span> working on task <span style="color: #00bcff;">1</span>
I am process <span style="color: #00bcff;">18376</span> working on task <span style="color: #00bcff;">6</span>
I am process <span style="color: #00bcff;">18377</span> working on task <span style="color: #00bcff;">2</span>
I am process <span style="color: #00bcff;">18376</span> working on task <span style="color: #00bcff;">7</span>
I am process <span style="color: #00bcff;">18376</span> working on task <span style="color: #00bcff;">8</span>
I am process <span style="color: #00bcff;">18377</span> working on task <span style="color: #00bcff;">3</span>
I am process <span style="color: #00bcff;">18376</span> working on task <span style="color: #00bcff;">9</span>
I am process <span style="color: #00bcff;">18377</span> working on task <span style="color: #00bcff;">4</span>
</pre>
</div>

<p>
These examples show at a lower level than the <code>ProcessPoolExecutor</code>
how multiprocessing works. However, if you want to extend the latter
approach into working code that deals with failures, passes the tasks
to the processes consistently and also collects the results, you can
see it'll get quite a bit more complicated. Enter the
<code>ProcessPoolExecutor</code>, which does all those hard things for you! 
</p>

<div class="org-src-container">
<pre class="src src-bash">cat ./src/ppool_demo.py
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #b6a0ff;">from</span> concurrent.futures <span style="color: #b6a0ff;">import</span> ProcessPoolExecutor
<span style="color: #b6a0ff;">import</span> time
<span style="color: #b6a0ff;">import</span> os

<span style="color: #00d3d0;">tasks</span> = <span style="color: #f78fe7;">range</span><span style="color: #ffffff;">(</span><span style="color: #00bcff;">10</span><span style="color: #ffffff;">)</span>
<span style="color: #00d3d0;">start</span> = time.time<span style="color: #ffffff;">()</span>


<span style="color: #b6a0ff;">def</span> <span style="color: #feacd0;">do_work</span><span style="color: #ffffff;">(</span>task<span style="color: #ffffff;">)</span>:
    <span style="color: #f78fe7;">print</span><span style="color: #ffffff;">(</span>f<span style="color: #79a8ff;">"I am process </span>{os.getpid()}<span style="color: #79a8ff;"> working on task </span>{task}<span style="color: #79a8ff;">"</span><span style="color: #ffffff;">)</span>
    time.sleep<span style="color: #ffffff;">(</span>.<span style="color: #00bcff;">2</span><span style="color: #ffffff;">)</span>


<span style="color: #b6a0ff;">with</span> ProcessPoolExecutor<span style="color: #ffffff;">(</span>max_workers=<span style="color: #00bcff;">4</span><span style="color: #ffffff;">)</span> <span style="color: #b6a0ff;">as</span> pool:
    <span style="color: #b6a0ff;">for</span> task <span style="color: #b6a0ff;">in</span> tasks:
        pool.submit<span style="color: #ffffff;">(</span>do_work, task<span style="color: #ffffff;">)</span>

<span style="color: #f78fe7;">print</span><span style="color: #ffffff;">(</span>f<span style="color: #79a8ff;">"Main process done after </span>{time.time() - start:.2f}<span style="color: #79a8ff;">s"</span><span style="color: #ffffff;">)</span>
</pre>
</div>

<p>
In only three lines you can start 4 workers that divide the work as
evenly as possible.
</p>

<ul class="org-ul">
<li><code>pool.submit</code> sends a task to one of the workers</li>
<li>The context manager (<code>with</code> block) waits until all the workers are
done before proceeding</li>
</ul>

<p>
This example takes 0.6 seconds. We have four workers, 10 tasks, so
some workers get 2 tasks and some get 3 tasks, and the workers with 3
tasks take 3 * 0.2 seconds to finish.
</p>

<div class="org-src-container">
<pre class="src src-bash">python ./src/ppool_demo.py
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python">
</pre>
</div>

<p>
Note that in the output, the processes seem ordered. However, this is
a subtle effect of buffering of the <code>stdout</code>. Each process has its own
buffer and they flush all their output in one go, making it look like
they run in succession. You can surpress this behaviour by manually
triggering the flushes as I showed earlier with <code>sys.stdout.flush()</code>.
</p>

<p>
Here, it is crucial that <code>pool.submit</code> is non-blocking, if you call
the function the main process doesn't wait until the worker is
done. This allows us to schedule all the work to the workers quickly.
</p>

<p>
There are three things I want to explain in this post
</p>

<ul class="org-ul">
<li>How you can collect return values of the tasks (using
<code>concurrent.futures.Future</code>)</li>
<li>What happens if workers run into an exception and how you can deal
with it</li>
</ul>
</div>
</div>
