_org/_posts/2021-09-16-python-multiprocessing-pool.org
** Collecting return values

In the examples above, I simply fired off the tasks and showed that
they were doing something by printing statements to [[https://en.wikipedia.org/wiki/Standard_streams#Standard_output_(stdout)][stdout]]. But in a
practical situation, you typically want to collect the results of the
work. To do that with a ~ProcessPoolExecutor~, you will need to deal
with ~concurrent.futures.Future~. If you have experience with
Javascript for example, dealing with futures is very common, but you
can write quite a bit of python code without encountering these.

#+begin_src python
from concurrent.futures import ProcessPoolExecutor

def work(word):
    print(word)
    return len(word)

with ProcessPoolExecutor(max_workers=1) as pool:
    result = pool.submit(work, "hello")
    print(result)
#+end_src

#+RESULTS:
: hello
: <Future at 0x7f5cc0f58a00 state=finished returned int>

The result of a ~pool.submit~ is an instance of [[https://docs.python.org/3/library/concurrent.futures.html#future-objects][~Future~]]. A ~Future~ is a
reference to work in progress. Its most fundamental method is
~Future.result~. From the official documentation

#+begin_quote
Return the value returned by the call. If the call hasn’t yet
completed then this method will wait up to timeout seconds. If the
call hasn’t completed in timeout seconds, then a
concurrent.futures.TimeoutError will be raised. timeout can be an int
or float. If timeout is not specified or None, there is no limit to
the wait time.

If the future is cancelled before completing then CancelledError will
be raised.

If the call raised an exception, this method will raise the same
exception.
#+end_quote

It is important to understand that this method is *blocking*, as
opposed to the ~pool.submit~ method I used earlier. A mistake I have
seen often is the following:

#+begin_src bash
cat ./src/block_mistake.py
#+end_src

#+RESULTS:
#+begin_src python
from concurrent.futures import ProcessPoolExecutor
import time

tasks = list(range(10))
results = list()
start = time.time()


def do_work(task):
    time.sleep(0.1)
    return task ** 2


with ProcessPoolExecutor(max_workers=10) as pool:
    for task in tasks:
        future = pool.submit(do_work, task)
        results.append(future.result())  # collect results

print(f"Done after {time.time() - start}")
#+end_src

Can you spot the mistake? The problem is that before scheduling the
next task, the main process waits the result of the task just
scheduled. This script takes 1 second to run, because in effect, all
tasks are run in succession.

#+begin_src bash
python ./src/block_mistake.py
#+end_src

#+RESULTS:
#+begin_src
Done after 1.0331628322601318
#+end_src

Instead, the results should be collected after the process pool
context is done scheduling the tasks.

#+begin_src bash
cat ./src/block_fixed.py
#+end_src

#+RESULTS:
#+begin_src
from concurrent.futures import ProcessPoolExecutor
import time

start = time.time()

tasks = list(range(10))
futures = list()


def do_work(task):
    time.sleep(0.1)
    return task ** 2


with ProcessPoolExecutor(max_workers=10) as pool:
    for task in tasks:
        futures.append(pool.submit(do_work, task))

results = [future.result() for future in futures]

print(results)
print(f"Done after {time.time() - start}")
#+end_src

#+begin_src bash
python ./src/block_fixed.py
#+end_src

#+RESULTS:
#+begin_src
[0, 1, 4, 9, 16, 25, 36, 49, 64, 81]
Done after 0.10692763328552246
#+end_src

** Dealing with exceptions in child processes

If a child process raises a unhandled ~Exception~, this exception is
passed to the main process when calling ~Future.result~. In the
example below, you can see how to catch those errors when unpacking
the results of the process workers.

#+begin_src bash
cat ./src/error_example.py
#+end_src

#+RESULTS:
#+begin_src
from concurrent.futures import ProcessPoolExecutor
from random import random

tasks = range(10)
futures = list()


def do_work(task):
    if random() > .5:
        return task ** 2
    else:
        raise Exception("OW!")


with ProcessPoolExecutor(max_workers=10) as pool:
    for task in tasks:
        futures.append(pool.submit(do_work, task))

results = list()

for future in futures:
    try:
        results.append(future.result())
    except Exception as e:
        results.append(f"Failed with {e}!")

print(results)
#+end_src

#+begin_src bash
python ./src/error_example.py
#+end_src

#+RESULTS:
#+begin_src
[0, 1, 4, 9, 16, 'Failed with OW!!', 'Failed with OW!!', 'Failed with OW!!', 64, 81]
#+end_src

Thanks for reading! If you want to reach out, post an issue to the
[[https://github.com/Gijs-Koot/Gijs-Koot.github.io][Github repository of this website]] or contact me on Twitter!
