_posts/2021-09-16-python-multiprocessing-pool.md

<div id="outline-container-org6424cf4" class="outline-3">
<h3 id="org6424cf4">Collecting return values</h3>
<div class="outline-text-3" id="text-org6424cf4">
<p>
In the examples above, I simply fired off the tasks and showed that
they were doing something by printing statements to <a href="https://en.wikipedia.org/wiki/Standard_streams#Standard_output_(stdout)">stdout</a>. But in a
practical situation, you typically want to collect the results of the
work. To do that with a <code>ProcessPoolExecutor</code>, you will need to deal
with <code>concurrent.futures.Future</code>. If you have experience with
Javascript for example, dealing with futures is very common, but you
can write quite a bit of python code without encountering these.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #b6a0ff;">from</span> concurrent.futures <span style="color: #b6a0ff;">import</span> ProcessPoolExecutor

<span style="color: #b6a0ff;">def</span> <span style="color: #feacd0;">work</span><span style="color: #ffffff;">(</span>word<span style="color: #ffffff;">)</span>:
    <span style="color: #f78fe7;">print</span><span style="color: #ffffff;">(</span>word<span style="color: #ffffff;">)</span>
    <span style="color: #b6a0ff;">return</span> <span style="color: #f78fe7;">len</span><span style="color: #ffffff;">(</span>word<span style="color: #ffffff;">)</span>

<span style="color: #b6a0ff;">with</span> ProcessPoolExecutor<span style="color: #ffffff;">(</span>max_workers=<span style="color: #00bcff;">1</span><span style="color: #ffffff;">)</span> <span style="color: #b6a0ff;">as</span> pool:
    result = pool.submit<span style="color: #ffffff;">(</span>work, <span style="color: #79a8ff;">"hello"</span><span style="color: #ffffff;">)</span>
    <span style="color: #f78fe7;">print</span><span style="color: #ffffff;">(</span>result<span style="color: #ffffff;">)</span>
</pre>
</div>

<p>
The result of a <code>pool.submit</code> is an instance of <a href="https://docs.python.org/3/library/concurrent.futures.html#future-objects"><code>Future</code></a>. A <code>Future</code> is a
reference to work in progress. Its most fundamental method is
<code>Future.result</code>. From the official documentation
</p>

<blockquote>
<p>
Return the value returned by the call. If the call hasn’t yet
completed then this method will wait up to timeout seconds. If the
call hasn’t completed in timeout seconds, then a
concurrent.futures.TimeoutError will be raised. timeout can be an int
or float. If timeout is not specified or None, there is no limit to
the wait time.
</p>

<p>
If the future is cancelled before completing then CancelledError will
be raised.
</p>

<p>
If the call raised an exception, this method will raise the same
exception.
</p>
</blockquote>

<p>
It is important to understand that this method is <b>blocking</b>, as
opposed to the <code>pool.submit</code> method I used earlier. A mistake I have
seen often is the following:
</p>

<div class="org-src-container">
<pre class="src src-bash">cat ./src/block_mistake.py
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #b6a0ff;">from</span> concurrent.futures <span style="color: #b6a0ff;">import</span> ProcessPoolExecutor
<span style="color: #b6a0ff;">import</span> time

<span style="color: #00d3d0;">tasks</span> = <span style="color: #f78fe7;">range</span><span style="color: #ffffff;">(</span><span style="color: #00bcff;">10</span><span style="color: #ffffff;">)</span>
<span style="color: #00d3d0;">results</span> = <span style="color: #f78fe7;">list</span><span style="color: #ffffff;">()</span>
<span style="color: #00d3d0;">start</span> = time.time<span style="color: #ffffff;">()</span>


<span style="color: #b6a0ff;">def</span> <span style="color: #feacd0;">do_work</span><span style="color: #ffffff;">(</span>task<span style="color: #ffffff;">)</span>:
    time.sleep<span style="color: #ffffff;">(</span><span style="color: #00bcff;">0</span>.<span style="color: #00bcff;">1</span><span style="color: #ffffff;">)</span>
    <span style="color: #b6a0ff;">return</span> task ** <span style="color: #00bcff;">2</span>


<span style="color: #b6a0ff;">with</span> ProcessPoolExecutor<span style="color: #ffffff;">(</span>max_workers=<span style="color: #00bcff;">10</span><span style="color: #ffffff;">)</span> <span style="color: #b6a0ff;">as</span> pool:
    <span style="color: #b6a0ff;">for</span> task <span style="color: #b6a0ff;">in</span> tasks:
        future = pool.submit<span style="color: #ffffff;">(</span>do_work, task<span style="color: #ffffff;">)</span>
        results.append<span style="color: #ffffff;">(</span>future.result<span style="color: #ff62d4;">()</span><span style="color: #ffffff;">)</span>  <span style="color: #a8a8a8;"># </span><span style="color: #a8a8a8;">collect results</span>

<span style="color: #f78fe7;">print</span><span style="color: #ffffff;">(</span>f<span style="color: #79a8ff;">"Done after </span>{time.time() - start}<span style="color: #79a8ff;">"</span><span style="color: #ffffff;">)</span>
</pre>
</div>

<p>
Can you spot the mistake? The problem is that before scheduling the
next task, the main process waits the result of the task just
scheduled. This script takes 1 second to run, because in effect, all
tasks are run in succession.
</p>

<div class="org-src-container">
<pre class="src src-bash">python ./src/block_mistake.py
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python">
</pre>
</div>

<p>
Instead, the results should be collected after the process pool
context is done scheduling the tasks.
</p>

<div class="org-src-container">
<pre class="src src-bash">cat ./src/block_fixed.py
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #b6a0ff;">from</span> concurrent.futures <span style="color: #b6a0ff;">import</span> ProcessPoolExecutor
<span style="color: #b6a0ff;">import</span> time

<span style="color: #00d3d0;">start</span> = time.time<span style="color: #ffffff;">()</span>

<span style="color: #00d3d0;">tasks</span> = <span style="color: #f78fe7;">range</span><span style="color: #ffffff;">(</span><span style="color: #00bcff;">10</span><span style="color: #ffffff;">)</span>
<span style="color: #00d3d0;">futures</span> = <span style="color: #f78fe7;">list</span><span style="color: #ffffff;">()</span>


<span style="color: #b6a0ff;">def</span> <span style="color: #feacd0;">do_work</span><span style="color: #ffffff;">(</span>task<span style="color: #ffffff;">)</span>:
    time.sleep<span style="color: #ffffff;">(</span><span style="color: #00bcff;">0</span>.<span style="color: #00bcff;">1</span><span style="color: #ffffff;">)</span>
    <span style="color: #b6a0ff;">return</span> task ** <span style="color: #00bcff;">2</span>


<span style="color: #b6a0ff;">with</span> ProcessPoolExecutor<span style="color: #ffffff;">(</span>max_workers=<span style="color: #00bcff;">10</span><span style="color: #ffffff;">)</span> <span style="color: #b6a0ff;">as</span> pool:
    <span style="color: #b6a0ff;">for</span> task <span style="color: #b6a0ff;">in</span> tasks:
        futures.append<span style="color: #ffffff;">(</span>pool.submit<span style="color: #ff62d4;">(</span>do_work, task<span style="color: #ff62d4;">)</span><span style="color: #ffffff;">)</span>

results = <span style="color: #ffffff;">[</span>future.result<span style="color: #ff62d4;">()</span> <span style="color: #b6a0ff;">for</span> future <span style="color: #b6a0ff;">in</span> futures<span style="color: #ffffff;">]</span>

<span style="color: #f78fe7;">print</span><span style="color: #ffffff;">(</span>results<span style="color: #ffffff;">)</span>
<span style="color: #f78fe7;">print</span><span style="color: #ffffff;">(</span>f<span style="color: #79a8ff;">"Done after </span>{time.time() - start}<span style="color: #79a8ff;">"</span><span style="color: #ffffff;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-bash">python ./src/block_fixed.py
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python">
</pre>
</div>
</div>
</div>

<div id="outline-container-org1d86d84" class="outline-3">
<h3 id="org1d86d84">Dealing with exceptions in child processes</h3>
<div class="outline-text-3" id="text-org1d86d84">
<p>
If a child process raises a unhandled <code>Exception</code>, this exception is
passed to the main process when calling <code>Future.result</code>. In the
example below, you can see how to catch those errors when unpacking
the results of the process workers.
</p>

<div class="org-src-container">
<pre class="src src-bash">cat ./src/error_example.py
</pre>
</div>

<pre class="example">
from concurrent.futures import ProcessPoolExecutor
from random import random

tasks = range(10)
futures = list()


def do_work(task):
    if random() &gt; .5:
        return task ** 2
    else:
        raise Exception("OW!")


with ProcessPoolExecutor(max_workers=10) as pool:
    for task in tasks:
        futures.append(pool.submit(do_work, task))

results = list()

for future in futures:
    try:
        results.append(future.result())
    except Exception as e:
        results.append(f"Failed with {e}!")

print(results)
</pre>

<div class="org-src-container">
<pre class="src src-bash">python ./src/error_example.py
</pre>
</div>

<pre class="example">
[0, 1, 4, 9, 16, 'Failed with OW!!', 'Failed with OW!!', 'Failed with OW!!', 64, 81]
</pre>

<p>
Thanks for reading! If you want to reach out, post an issue to the
<a href="https://github.com/Gijs-Koot/Gijs-Koot.github.io">Github repository of this website</a> or contact me on Twitter!
</p>
</div>
</div>
</div>
